---
kind: enumMember
id: F:Autodesk.Revit.DB.FamilyPlacementType.ViewBased
enum: Autodesk.Revit.DB.FamilyPlacementType
source: html/2abb8627-1da3-4069-05c9-19e4be5e02ad.htm
---
# Autodesk.Revit.DB.FamilyPlacementType.ViewBased

The family is view-specific (e.g. a detail annotation)